src/InformationRegisters/Релизы/Релизы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Релизы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВерсияОбъектаРазработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРазработки</name>
    <type>
      <types>CatalogRef.ОбъектыРазработки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Релизы/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ОбъектыРазработкиПоследнихРелизов(Проект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РелизыСрезПоследних.Проект КАК Проект,
	|	РелизыСрезПоследних.ОбъектРазработки КАК ОбъектРазработки,
	|	РелизыСрезПоследних.ВерсияОбъектаРазработки КАК ВерсияОбъектаРазработки
	|ИЗ
	|	РегистрСведений.Релизы.СрезПоследних(, Проект = &Проект) КАК РелизыСрезПоследних";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
